# Необходимо создать (не программно) текстовый файл,
# где каждая строка описывает учебный предмет и наличие лекционных,
# практических и лабораторных занятий по этому предмету и их количество.
# Важно, чтобы для каждого предмета не обязательно были все типы занятий.
# Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.
# Примеры строк файла:
# Информатика:   100(л)   50(пр)   20(лаб).
# Физика:   30(л)   —   10(лаб)
# Физкультура:   —   30(пр)   —
# Пример словаря: {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

import re

a = []
b = {}

# открываем файл, считываем данные
with open("file_5_6.txt") as out_f:
    for i in out_f.readlines():
        # применяем регулярное выражение для поиска цифр в строке и преобразуем в int
        k = [int(s) for s in re.findall(r'\b\d+\b', i)]
        a = i.split()
        c = a[0]
        d = sum(k)
        b[c] = d

print(b)
