# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

a = ["Hello", True, 254, 234.33, None]

for x in a:
    print(f"{x}: {type(x)}")

