'use sctrict';

/*
Напишите, являются ли данные имена переменных корректными:

let mode = "normal"; - корректно
let my_valu3 = 102; - корректно, но не несет смысловой нагрузки, никто не поймет что хотел сказать создатель переменной
let 3my_value3 = "102"; - нельзя начинать название переменной с цифры
let __hello__ = "world"; - корректно, но не несет смысловой нагрузки
let $$$ = "money"; - корректно, но не несет смысловой нагрузки
let !0_world = true; - нельзя начинать название переменной со знака ! и цифры


*/


